verification/runs/THERMAL_K0_runs/K0a_heated_box_g0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.00000 0.00000 0.00000)
    (0.03000 0.00000 0.00000)
    (0.07000 0.00000 0.00000)
    (0.10000 0.00000 0.00000)
    (0.00000 0.10000 0.00000)
    (0.03000 0.10000 0.00000)
    (0.07000 0.10000 0.00000)
    (0.10000 0.10000 0.00000)
    (0.00000 0.00000 0.01000)
    (0.03000 0.00000 0.01000)
    (0.07000 0.00000 0.01000)
    (0.10000 0.00000 0.01000)
    (0.00000 0.10000 0.01000)
    (0.03000 0.10000 0.01000)
    (0.07000 0.10000 0.01000)
    (0.10000 0.10000 0.01000)
);

blocks
(
    hex (0 1 5 4 8 9 13 12) (6 20 1) simpleGrading (1 1 1)
    hex (1 2 6 5 9 10 14 13) (8 20 1) simpleGrading (1 1 1)
    hex (2 3 7 6 10 11 15 14) (6 20 1) simpleGrading (1 1 1)
);

edges();

boundary
(
    hotSource
    {
        type wall;
        faces ( (1 2 10 9) );
    }
    floorAdiabatic
    {
        type wall;
        faces ( (0 1 9 8) (2 3 11 10) );
    }
    ceilingCold
    {
        type wall;
        faces ( (4 12 13 5) (5 13 14 6) (6 14 15 7) );
    }
    sideWalls
    {
        type wall;
        faces ( (0 8 12 4) (3 7 15 11) );
    }
    frontAndBack
    {
        type empty;
        faces ( (0 4 5 1) (1 5 6 2) (2 6 7 3) (8 9 13 12) (9 10 14 13) (10 11 15 14) );
    }
);

// ************************************************************************* //
